Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: འཁོར་འདིར་འོང་བར་སེམས་པ་ཤ་སྟག་ཀྱང་། ཤ་ར་དྭ་ཏིའི་བུ་ངས་ནི་འཇིག་རྟེན་ལྷ་དང་བཅས་པ། བདུད་དང་བཅས་པ། ཚངས་པར་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུའི་ནང་ན། གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བསྟན་པའི་ཚེ། ཞེ་སྡང་བའི་སེམས་སམ། གླགས་བལྟ་བའི་བསམ་པས་ཉེ་བར་འགྲོ་བ་མ་མཐོང་སྟེ།
en: Although without exception they all think they should come into this assembly, Śāradvatīputra, I do not see anyone among the living beings of this world, with its gods, demons, Brahmā deities, virtuous ascetics, and brāhmin priests who, while this perfection of wisdom is being taught, would approach with thoughts of hatred and intentions that seek to intrude [and cause harm].

source: དེ་ནི་གནས་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Such an occurrence is impossible!

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོངས་སུ་བཟུང་ངོ་།
en: If you ask why, Śāradvatīputra, it is because as many gods as there are in this great trichiliocosm, including the gods of the Caturmahā­rāja­kāyika realm and the gods of [the other god realms], up to and including Akaniṣṭha, as many śrāvakas and pratyekabuddhas as there are, and as many bodhisattvas as there are, have all acquired this perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ཤ་སྟག་གོ།
en: If you ask why, it is because all of them without exception have originated from the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོངས་སུ་བཟུང་ངོ་།
en: Moreover, Śāradvatīputra, in the world systems of the eastern direction, numerous as the grains of sand of the river Gaṅgā, however many lord buddhas reside with their communities of śrāvakas, and however many pratyekabuddhas, bodhisattva great beings, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas there are, they all have acquired this perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ཤ་སྟག་གོ། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་།
en: If you ask why, it is because all of them without exception have originated from the perfection of wisdom.

source: སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: In the world systems of each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, as well as the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, however many lord buddhas reside with their communities of śrāvakas, and however many pratyekabuddhas, bodhisattva great beings, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas there are, they all have acquired this perfection of wisdom.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོངས་སུ་བཟུང་ངོ་། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེ་དག་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ཤ་སྟག་གོ།
en: If you ask why, it is because all of them without exception have originated from the perfection of wisdom.”

source: །དེ་ནས་བདུད་སྡིག་ཏོ་ཅན་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་འཁོར་བཞི་པོ་འདི་དག་ཀྱང་མངོན་དུ་གྱུར།
en: Then the evil Māra had the following thought: “These four assemblies of the tathāgata, arhat, completely awakened Buddha are also present.

source: འདོད་པ་ལ་སྤྱོད་པ་དང་། གཟུགས་ལ་སྤྱོད་པའི་ལྷ་འདི་དག་ཀྱང་མངོན་དུ་གྱུར་པ་ལས།
en: These gods who frequent [the realm of] desire and the [realm of] form are also present. {

source: འདིར་ནི་གདོན་མི་ཟ་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་འགྱུར་གྱིས།
en: Ki.II-III: 75} In this gathering, it will certainly be prophesied that bodhisattva great beings will attain unsurpassed, complete enlightenment.

source: དེ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་བར་ཆད་བྱའོ་སྙམ་ནས།
en: I should go to that place where the Blessed One is and create obstacles!”

source: བདུད་སྡིག་ཏོ་ཅན་གྱིས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་མངོན་པར་སྤྲུལ་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་འགྲོ་འདོད་པར་གྱུར་པ་དང་།
en: Thereupon, the evil Māra conjured an army with four cohorts and sought to go to that place where the Blessed One was.

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: Then Śakra, mighty lord of the gods, had the following thought: “Alas!

source: །ཀྱེ་མ་བདུད་སྡིག་ཏོ་ཅན་འདི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་མངོན་པར་སྤྲུལ་ཅིང་། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་འགྲོ་བར་འདོད་ལ།
en: This evil Māra has conjured an army with four cohorts and he is seeking to go to that place where the Blessed One is.

source: བདུད་སྡིག་ཏོ་ཅན་གྱི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་རྣམ་པར་བཀོད་པ་འདི་ནི། རྒྱལ་པོ་བི་མ་བི་སཱ་རའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་རྣམ་པར་བཀོད་པས་ཀྱང་དེ་ཙམ་མི་ཕོད། རྒྱལ་པོ་སྡེ་རབ་ཏུ་ཕམ་བྱེད་དང་། ཤཱཀྱ་རྣམས་དང་། ལི་ཙ་བྱི་རྣམས་ཀྱི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་རྣམ་པར་བཀོད་པས་ཀྱང་དེ་ཙམ་མི་ཕོད་དེ།
en: However, this array of the army of the evil Māra with its four cohorts cannot be compared with the array of the army of King Bimbisāra with its four cohorts, and it cannot be compared with the arrays of the armies of King Prasenajit, the Śākyas, and the Licchavis.

source: བདུད་སྡིག་ཏོ་ཅན་འདི་ནི་ཡུན་རིང་པོ་ནས་བཅོམ་ལྡན་འདས་ལ་ཡང་གླགས་ལྟ་ཞིང་གླགས་ཚོལ།
en: This evil Māra has for a long time been seeking to intrude [in order to harm] the Blessed One.

source: སེམས་ཅན་ཡང་དག་པར་བརྩོན་པ་རྣམས་ལ་ཡང་གཙེ་བའི་བསམ་པ་ཅན་ཡིན་གྱིས།
en: Indeed, his intention is to hurt beings who are persevering in the correct manner.

source: བདག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་དག་པར་བསམ་པར་བྱའོ། །དྲན་པས་བརྗོད་པར་བྱའོ་སྙམ་ནས།
en: Therefore I should genuinely bring this perfection of wisdom to mind, and recite it from memory.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡང་དག་པར་བསམས་ཏེ། དྲན་པས་གསལ་བར་བརྗོད་པ་དང་།
en: Then Śakra, mighty lord of the gods, genuinely brought this perfection of wisdom to mind and recited it clearly from memory.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཇི་ལྟ་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གསལ་བར་བརྗོད་པ་དེ་ལྟ་དེ་ལྟར། བདུད་སྡིག་ཅན་དེ་དག་ལམ་དེ་ཉིད་དང་སྒོ་དེ་ཉིད་ནས་ཕྱིར་ལོག་གོ། །དེ་ནས་འཁོར་དེ་ན་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་དང་།
en: As Śakra, mighty lord of the gods, was clearly reciting this perfection of wisdom, so did those forces of evil Māra withdraw again by the same path and the same door.

source: འོག་མིན་གྱི་བར་གྱི་ལྷ་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་གིས། ལྷ་རྫས་ཀྱི་མེ་ཏོག་དང་། ན་བཟའ་མང་པོ་མངོན་པར་སྤྲུལ་ནས། བར་སྣང་གི་ནམ་མཁའ་ལ་འཁོད་བཞིན་དུ། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་གཏོར་ཏེ།
en: Then, however many gods of the Caturmahā­rāja­kāyika realm and gods of [the other god realms], up to and including Akaniṣṭha, were present in that assembly, they conjured up divine flowers and many robes, and while in the air, they scattered these upon the place where the Blessed One was seated.

source: མངོན་པར་གཏོར་ནས་ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །འཛམ་བུའི་གླིང་གི་མི་འདི་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་ཡུན་རིང་པོར་སྤྱོད་པར་གྱུར་ཅིག །
en: After scattering [those offerings], they said, “May the human beings of Jambudvīpa practice this perfection of wisdom for a long time!

source: འཛམ་བུའི་གླིང་གི་མི་འདི་དག་ཇི་སྲིད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་དེ་སྲིད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་ནུབ་པར་མི་འགྱུར་ལ། དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་ཤིང་། དགེ་འདུན་དཀོན་མཆོག་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེའོ།
en: As long as those human beings of Jambudvīpa practice this perfection of wisdom, so long will the tathāgatas, arhats, completely awakened buddhas not disappear, will the Dharma remain for a long period of time, and will the precious jewel of the saṅgha also continue to manifest in the world.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་ནུབ་པར་མི་འགྱུར་ལ།
en: Nor indeed will the tathāgatas, arhats, completely awakened buddhas of the great trichiliocosm and [of other realms], including the world systems of the ten directions, disappear.

source: དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་པོར་གནས་ཤིང་། དགེ་འདུན་དཀོན་མཆོག་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཞེའོ།
en: The Dharma will remain for a long period of time, and the precious jewel of the saṅgha will also continue to manifest in the world.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྤྱོད་པ་ཁྱད་པར་དུ་འཕགས་པ་ཡང་ཡོད་པར་འགྱུར་ཞེའོ།
en: The conduct of bodhisattva great beings will be even more distinguished.

source: །ཕྱོགས་གང་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བའི་ཕྱོགས་དེ་ནི་སྣང་བ་དང་ལྡན་པར་རིག་པར་བྱའོ།
en: Know that the places where the noble sons or noble daughters commit this perfection of wisdom to writing, make it into a book, and uphold it will be endowed with luminosity! {Ki.

source: །ཕྱོགས་དེ་ནི་མགོན་དང་བཅས་ཤིང་མུན་པ་དང་བྲལ་བར་རིག་པར་བྱའོ།
en: II-III: 76} Know that those places will be protected and free from darkness!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷའི་བུ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ཏེ།
en: Then the Blessed One addressed Śakra, mighty lord of the gods, and those gods of [the god realms], up to and including Akaniṣṭha, as follows: “Kauśika, it is so!

source: །ལྷའི་བུ་དག་དེ་དེ་བཞིན་ནོ།
en: Divine princes, it is so!

source: ཇི་སྲིད་དུ་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པ་དེ་སྲིད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་ནུབ་པར་མི་འགྱུར་ལ། དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་ཤིང་། དགེ་འདུན་དཀོན་མཆོག་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: As long as the human beings of Jambudvīpa practice this perfection of wisdom, so long indeed will the tathāgatas, arhats, completely awakened buddhas not disappear, will the Dharma also remain for a long period of time, and will the precious jewel of the saṅgha also continue to manifest in the world.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་ནུབ་པར་མི་འགྱུར་ལ།
en: Nor indeed will the tathāgatas, arhats, completely awakened buddhas of the great trichiliocosm and [of other realms], including the world systems of all the ten directions, disappear.

source: དམ་པའི་ཆོས་ཀྱང་ཡུན་རིང་དུ་གནས་ཤིང་། དགེ་འདུན་དཀོན་མཆོག་ཀྱང་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The Dharma will also remain for a long period of time, and the precious jewel of the saṅgha will also continue to manifest in the world.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྤྱོད་པ་ཁྱད་པར་དུ་འཕགས་པ་ཡང་ཡོད་པར་འགྱུར་རོ།
en: The conduct of bodhisattva great beings will be even more distinguished.

source: །ཕྱོགས་གང་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ་འཆང་བའི་ཕྱོགས་དེ་ནི་སྣང་བ་དང་ལྡན་པར་ངས་ཤེས་སོ།
en: I know that the places where the noble sons or noble daughters commit this perfection of wisdom to writing, make it into a book, and uphold it will be endowed with luminosity!

source: །ཕྱོགས་དེ་ནི་མགོན་དང་བཅས་ཤིང་མུན་པ་དང་བྲལ་བར་ངས་ཤེས་སོ།
en: I know that those places will be protected and free from darkness!”

source: །དེ་ནས་ལྷའི་བུ་དེ་དག་གིས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་མོད་པོ་མངོན་པར་སྤྲུལ་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་མངོན་པར་གཏོར་ཏེ། འདི་སྐད་ཀྱི་ཚིག་བརྗོད་དོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ། འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་ཅིང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་ལ་བདུད་དམ་བདུད་ཀྱི་རིགས་སུ་གཏོགས་པའི་ལྷ་གླགས་ཚོལ་བ་རྣམས་ཀྱིས་གླགས་མི་རྙེད་དོ།
en: Then those gods conjured up many divine flowers and, scattering them upon the place where the Blessed One was, they spoke as follows: “Blessed Lord, Māra or the gods included within the class of māras who seek to intrude [and cause harm] will find no opportunity to intrude [and harm] any noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ལ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་བསྲུང་བ་དང་། བསྐྱབ་པ་དང་། བསྐྱང་བར་བགྱིའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Indeed, Blessed Lord, we will always guard, shelter, and nurture those noble sons or noble daughters, without interruption.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་ནི་སྟོན་པའམ། སྟོན་པ་དང་མཚུངས་པ་ཙམ་དུ་བདག་ཅག་སེམས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས།
en: If one were to ask why, we consider those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom as the Teacher and as the Teacher’s equal.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་དམའ་བ་དང་ལྡན་པ་མ་ལགས་ཏེ།
en: Then Śakra, mighty lord of the gods, said to the Blessed One, “Blessed Lord, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom are not endowed with feeble roots of virtue.

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་བགྱི་བ་བགྱིད་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ།
en: Blessed Lord, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom have fulfilled their duties under the conquerors of the past.

source: རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་ནི། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བགྱིས་པར་འགྱུར། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ།
en: Blessed Lord, those noble sons or noble daughters who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will respect many buddhas, and they will be accepted by spiritual mentors.

source: །བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བཙལ་བར་བགྱིའོ།
en: If one were to ask why, Blessed Lord, it is because they seek all-aspect omniscience through this perfection of wisdom.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བཙལ་བར་བགྱིའོ།
en: Blessed Lord, they seek the perfection of wisdom through all-aspect omniscience.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་ལ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་མ་ལགས།
en: If one were to ask why, Blessed Lord, it is because the perfection of wisdom is not one distinct thing and all-aspect omniscience another.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་མ་ལགས་ཏེ།
en: All-aspect omniscience is not one distinct thing and the perfection of wisdom another.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལ་གཉིས་སུ་མ་མཆིས་ཏེ་གཉིས་སུ་བགྱིར་མ་མཆིས་སོ།།
en: The perfection of wisdom and all-aspect omniscience are not two things and cannot be divided into two.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ།
en: The Blessed One replied, {Ki.

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: Kauśika, the all-aspect omniscience of the tathāgatas, arhats, completely awakened buddhas has originated from the perfection of wisdom.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་བྱུང་བ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: The perfection of wisdom has originated from all-aspect omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་ལ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན།
en: If you ask why, Kauśika, it is because the perfection of wisdom is not one distinct thing and all-aspect omniscience another.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་། གཞན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Nor is all-aspect omniscience one distinct thing and the perfection of wisdom another.

source: དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: So it is that the perfection of wisdom and all-aspect omniscience are not two things and cannot be divided into two.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་བ་ལས། ལེའུ་ཉི་ཤུ་པའོ།། །།
en: This completes the twentieth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་ཡོངས་སུ་བརྗོད་པར་མཛད་པ་དེ་ལྟར། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད།
en: Chapter 21 Then the venerable Ānanda said to the Blessed One, “Blessed Lord, the name of the perfection of generosity is not as well known as the name of the perfection of wisdom.

source: དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། དེ་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ།
en: Nor are the names of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, and the perfection of meditative concentration as well known.

source: །དེ་ལྟར་ན་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ།
en: Nor are the names of the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, as well known.

source: །དེ་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ། །དེ་ལྟར་ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: Nor are the names of the applications of mindfulness as well known.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ།
en: Nor are the names of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path as well known.

source: །དེ་ལྟར་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ།
en: Nor are the names of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions as well known.

source: །དེ་ལྟར་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ།
en: Nor are the names of the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways as well known.

source: །དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་མིང་ཡང་ཡོངས་སུ་བརྗོད་པ་མ་མཛད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ། དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་།
en: Nor are the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the distinct qualities of the buddhas as well known.” “

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དག་གི་ཐོག་མར་འགྲོའོ།
en: Ānanda,” replied the Blessed One, “this is because this perfection of wisdom has precedence over the five other perfections, all the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: །ཀུན་དུ་འདྲེན་པའོ།
en: It guides them all. “

source: །དགའ་བོ་དེ་ཇི་སྙམ་དུ་སེམས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྡོས་པའི་སྦྱིན་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནམ།
en: Ānanda, do you think that giving that is not dedicated toward all-aspect omniscience is indicative of the perfection of generosity?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྔོས་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་ཤེས་རབ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནམ། གསོལ་པ།
en: Do you think that ethical discipline, tolerance, perseverance, meditative concentration, and wisdom that are not dedicated toward all-aspect omniscience are indicative of the perfection of wisdom [and so forth]?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ན།
en: No, Blessed Lord!” he replied. “

source: བཅོམ་ལྡན་འདས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཇི་ལྟར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལགས།
en: Blessed Lord, in what way is giving, when dedicated toward all-aspect omniscience, indicative of the perfection of generosity, {Ki.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཇི་ལྟར་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལགས།
en: II-III: 78} and in what way are ethical discipline, tolerance, perseverance, meditative concentration, and wisdom, when dedicated toward all-aspect omniscience, indicative of the perfection of wisdom [and so forth]?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ་དགའ་བོ་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་ནི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནོ། །དགའ་བོ་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས།
en: Ānanda,” the Blessed One answered, “giving that is dedicated toward all-aspect omniscience in a nondual manner is indicative of the perfection of generosity.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡིན་ནོ། །མི་སྐྱེ་བའི་ཚུལ་དང་།
en: Ānanda, ethical discipline, tolerance, perseverance, meditative concentration, and wisdom that are dedicated toward all-aspect omniscience in a nondual manner are indicative of the perfection of wisdom [and so forth].
